oar/array.html
---
layout: page
title: Array
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Array</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Konvention: Elemente werden <i>zusammenhängend</i> und <i>entsprechend ihrer
Reihenfolge</i> im Array im Speicher abgelegt. Diese Konvention
ermöglicht den einfachen Zugriff auf Elemente des Arrays über
</li>
<li>zweidimensionale Arrays folgen der <i>row-major ordering</i> Konvention,
d.h. die Zeilen eines Arrays <code>a</code> werden zusammenhängend im Speicher
abgelegt, wenn man der Konvention folgt <code>a[i]</code> als <code>i</code>-te Zeile von
<code>a</code> zu interpretieren.
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> multi-level-array</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>int *a[3]</code>
</p>

<ul class="org-ul">
<li>Spalten können unterschiedlich lang sein
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> nested-array</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>int a[3][3]</code>
</p>

<ul class="org-ul">
<li>Spalten müssen gleichlang sein
</li>
</ul>
</div>
</div>
</div>
